app/Controllers/Agensi.php

    	public function agensi_statistik_kemaskini($bulan, $tahun)
	{

        $model = new StatistikAgensiModel();
        $db = \Config\Database::connect();
        $id_agensi = session()->get('id_agensi');

        // Ambil senarai kategori isu untuk dropdown
        $kategori_isu = $db->table('ref_issue_category')
                       ->select('id_kategori_isu, keterangan_kategori')
                       ->get()
                       ->getResultArray();
---
SELECT `id_kategori_isu`, `keterangan_kategori`
FROM `ref_issue_category`

public function tambah_baru()
{
    $db = \Config\Database::connect();
    $id_agensi = session()->get('id_agensi');

    $bulan_ini = (int)date('m');
    $tahun_ini = (int)date('Y');

    // 1. Semak jika agensi ini sudah mempunyai rekod untuk bulan/tahun ini
    $exists = $db->table('table_report')
        ->join('table_quarters_profile', 'table_quarters_profile.id_kuarters = table_report.id_kuarters')
        ->where('table_quarters_profile.id_agensi_induk', $id_agensi)
        ->where('table_report.bulan', $bulan_ini)
        ->where('table_report.tahun', $tahun_ini)
        ->countAllResults();

    if ($exists > 0) {
        return redirect()->to(base_url('index.php/agensi/statistik'))->with('error', 'Rekod bagi bulan semasa sudah wujud dalam sistem.');
    }

    // 2. Ambil semua data terakhir (bulan sebelum) untuk agensi tersebut
    $last_report = $db->table('table_report')
        ->select('table_report.*')
        ->join('table_quarters_profile', 'table_quarters_profile.id_kuarters = table_report.id_kuarters')
        ->where('table_quarters_profile.id_agensi_induk', $id_agensi)
        ->orderBy('table_report.tahun', 'DESC')
        ->orderBy('table_report.bulan', 'DESC')
        ->get()
        ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `table_report`
JOIN `table_quarters_profile` ON `table_quarters_profile`.`id_kuarters` = `table_report`.`id_kuarters`
WHERE `table_quarters_profile`.`id_agensi_induk` = '2'
AND `table_report`.`bulan` = 1
AND `table_report`.`tahun` = 2026
SELECT `table_report`.*
FROM `table_report`
JOIN `table_quarters_profile` ON `table_quarters_profile`.`id_kuarters` = `table_report`.`id_kuarters`
WHERE `table_quarters_profile`.`id_agensi_induk` = '2'
ORDER BY `table_report`.`tahun` DESC, `table_report`.`bulan` DESC

    // 3. Masukkan data secara batch
    if (!empty($data_baru)) {
        try {
            $db->table('table_report')->insertBatch($data_baru);
---
INSERT INTO `table_report` (`baik_diduduki`, `baik_guna_sama`, `baik_sewaan`, `baik_tukar_fungsi`, `bulan`, `catatan`, `dihuni_baik`, `dihuni_rosak`, `id_kategori_isu`, `id_kuarters`, `jangkaan_pelaksanaan`, `jumlah_permohonan`, `ket_baik_guna_sama`, `ket_baik_sewaan`, `ket_baik_tukar_fungsi`, `ket_rosak_baik_pulih`, `ket_rosak_guna_sama`, `ket_rosak_roboh`, `ket_rosak_sewaan`, `ket_rosak_tukar_fungsi`, `keterangan_isu`, `kos_rm`, `rosak_baik_pulih`, `rosak_guna_sama`, `rosak_roboh`, `rosak_sewaan`, `rosak_tukar_fungsi`, `senarai_kerja`, `status_hantar`, `status_tindakan`, `tahun`, `total_unit_kuarters`, `unit_dihuni`, `unit_tidak_dihuni`)
VALUES ('8','0','0','0',1,'Sampel Data ID 14','10','2','14','37',NULL,'10',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'','0.00','0','0','0','0','0','',0,'',2026,'1053','1045','8')

public function agensi_statistik_papar($bulan, $tahun)
{
    $model = new \App\Models\StatistikAgensiModel();
    $db = \Config\Database::connect();

    $id_agensi = session()->get('id_agensi');

    // Ambil rujukan kategori isu daripada jadual yang betul
    $kategori_isu = $db->table('ref_issue_category')->get()->getResultArray();
---
SELECT *
FROM `ref_issue_category`