app/Models/Model_Auth.php

    public function login($email,$password)
    {
        return  $this->db->table('tbl_user')->where([
            'email'=>$email,
            'password'=>$password,
        ])->get()->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `email` = 'yunizar@moha.gov.my'
AND `password` = 'bd685e8384ab67eb8a74a5dc4a80eddb'