app/Models/Model_Bahagian.php

SELECT *
FROM `tbl_bahagian`
---
    public function get_all_data()
    {
        return $this->db->table('tbl_bahagian')->get()->getResultArray();