app/Models/Model_User.php

    function carian_pengguna($nama_penuh, $email)
{
    $builder = $this->db->table('tbl_user');
    // Sentiasa susun yang terbaru di atas, untuk kedua-dua kes
    $builder->orderBy('id_user', 'DESC');

    // Semak jika ada kriteria carian (sama ada nama ATAU email diisi)
    if ($nama_penuh || $email) {
        // --- BLOK INI HANYA JALAN JIKA ADA CARIAN ---

        if ($nama_penuh) {
            $builder->like('nama_penuh', $nama_penuh, 'both'); //'%match%'
        }
        if ($email) {
            $builder->like('email', $email, 'both'); //'%match%'
        }

        // Hadkan kepada 1000 keputusan untuk carian
        $builder->limit(200);

    } else {
        // --- BLOK INI JALAN JIKA TIADA CARIAN (muat halaman biasa) ---

        // Papar 20 senarai yang terbaru sahaja
        $builder->limit(20);
    }

    // Jalankan query dan pulangkan hasil
    return $builder->get()->getResultArray();
---
SELECT *
FROM `tbl_user`
ORDER BY `id_user` DESC
 LIMIT 20