app/Models/Model_Level.php

    public function get_all_data()
    {
        return $this->db->table('tbl_peranan')
            ->orderBy('peranan', 'DESC') // DESC untuk susunan Z-A
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_peranan`