app/Models/StatistikAgensiModel.php

SELECT `tr`.*, `tqp`.`kod_kuarters`, `tqp`.`nama_kuarters`, `tqp`.`jenis_kuarters`
FROM `table_report` `tr`
JOIN `table_quarters_profile` `tqp` ON `tqp`.`id_kuarters` = `tr`.`id_kuarters`
WHERE `tqp`.`id_agensi_induk` = '1'
AND `tr`.`bulan` = '1'
AND `tr`.`tahun` = '2026'
---
public function getDetailedReport($bulan, $tahun, $id_agensi)
{
    return $this->db->table('table_report tr')
        ->select('tr.*, tqp.kod_kuarters, tqp.nama_kuarters, tqp.jenis_kuarters') // Pastikan ada tqp.jenis_kuarters
        ->join('table_quarters_profile tqp', 'tqp.id_kuarters = tr.id_kuarters')
        ->where('tqp.id_agensi_induk', $id_agensi)
        ->where('tr.bulan', $bulan)
        ->where('tr.tahun', $tahun)
        ->get()
        ->getResultArray();

SELECT `table_report`.*, `tqp`.`kod_kuarters`, `tqp`.`nama_kuarters`, `tqp`.`jenis_kuarters`, `ric`.`keterangan_kategori`
FROM `table_report`
JOIN `table_quarters_profile` as `tqp` ON `tqp`.`id_kuarters` = `table_report`.`id_kuarters`
LEFT JOIN `ref_issue_category` as `ric` ON `ric`.`id_kategori_isu` = `table_report`.`id_kategori_isu`
WHERE `tqp`.`id_agensi_induk` = '2'
AND `table_report`.`bulan` = '12'
AND `table_report`.`tahun` = '2025'
---
public function getDetailedReportView($bulan, $tahun, $id_agensi)
{
    return $this->db->table($this->table_report)
        ->select("
            {$this->table_report}.*,
            tqp.kod_kuarters,
            tqp.nama_kuarters,
            tqp.jenis_kuarters,
            ric.keterangan_kategori
        ")
        ->join("{$this->table} as tqp", "tqp.id_kuarters = {$this->table_report}.id_kuarters")
        ->join('ref_issue_category as ric', "ric.id_kategori_isu = {$this->table_report}.id_kategori_isu", 'left')

        // KEMASKINI: Menggunakan id_agensi_induk seperti dalam pangkalan data anda
        ->where('tqp.id_agensi_induk', $id_agensi)

        ->where("{$this->table_report}.bulan", $bulan)
        ->where("{$this->table_report}.tahun", $tahun)
        ->get()
        ->getResultArray();